Tekla Open API Reference for Tekla Structures 2025
AnalysisModelModalAnalysisProperties Properties
The AnalysisModelModalAnalysisProperties type exposes the following members.
Properties
Name | Description
ModalAnalysisIncludeSelfWeightMass
 Indicates whether selfweight mass is included in the modal analysis.
ModalAnalysisMassLoadGroupDirections
 The mass load group directions of the modal analysis.
ModalAnalysisMassLoadGroupFactors
 The mass load group factors of the modal analysis.
ModalAnalysisMassLoadGroupIds
 The mass load group indentifier of the modal analysis.
ModalAnalysisMaxFrequency
 The modal analysis maximum frequence.
ModalAnalysisModeCount
 The modal analysis mode count.
ModalAnalysisModel
 Indicates whether a modal analysis model is used.
Top
See Also
Reference
AnalysisModelModalAnalysisProperties Class
Tekla.Structures.Analysis Namespace